Revit 2024 API
BuiltInFailures.EnergyAnalysisFailures Class
 Failures about EnergyAnalysis.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class EnergyAnalysisFailures
Visual Basic
Public NotInheritable Class EnergyAnalysisFailures
Visual C++
public ref class EnergyAnalysisFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures
See Also
BuiltInFailures.EnergyAnalysisFailures Members
Autodesk.Revit.DB Namespace